app/views/songs/_form.html.erb

SELECT "artists".* FROM "artists"
---
  <%= f.label :artist_id %>
  <%= f.collection_select(:artist_id, Artist.all, :id, :name) %>