app/controllers/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT "songs".* FROM "songs" ORDER BY name desc

  def show
    @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def edit
    @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]